package com.javarush.task.task01.task0138;

/* 
Любимое стихотворение
*/

public class Solution {
    public static void main(String[] args) {
        System.out.println("Мое любимое стихотворение:");
        //напишите тут ваш код
        System.out.println("В дверях эдема ангел нежный");
        System.out.println("Главой поникшею сиял,");
        System.out.println("А демон мрачный и мятежный");
        System.out.println("Над адской бездною летал.");

    }
}


//    В методе main напиши код, чтобы в результате выполнения программы было выведено твое любимое стихотворение.
//        В стихотворении должно быть не меньше, чем 4 строчки. Не убирай вывод строчки «Мое любимое стихотворение:».


//    В дверях эдема ангел нежный
//        Главой поникшею сиял,
//        А демон мрачный и мятежный
//        Над адской бездною летал.